tutorials/testcases/cavity/single/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     commentedSimpleFoam;

startFrom       latestTime;
//startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1e-00;

writeControl    timeStep;
writeInterval   100;

//writeControl    adjustableRunTime;
//writeInterval   0.01;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable true;

libs ("libBellerophon.so");

//functions
//{
//    forces
//    {
//        type            forceCoeffs;
//        functionObjectLibs ( "libforces.so" );
//        outputControl   timeStep;
//        outputInterval  1;
//
//        patches
//        (
//            cylinder
//        );
//
//        pName       p;
//        UName       U;
//        rhoName     rhoInf;
//        log         true;
//        rhoInf      1;
//        CofR        ( 0 0 0 );
//        liftDir     ( 0 1 0 );
//        dragDir     ( 1 0 0 );
//        pitchAxis   ( 0 0 1 );
//        magUInf     1;
//        lRef        1;
//        Aref        1;
//    }
//}

// ************************************************************************* //
